In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sqlalchemy import create_engine, inspect

In [2]:
USERNAME = 'postgres'
PASSWORD = "postgres"
IP_ADDRESS = "127.0.0.1"
PORT = "5432"
DB = "SQL_HW"

In [3]:
connection_string = f'postgresql://{USERNAME}:{PASSWORD}@localhost/{DB}'
engine = create_engine(connection_string)
# engine = create_engine('postgresql://localhost:postgres@localhost:5432/SQL_HW')

In [4]:
query = """
        select
            e.emp_no,
            e.last_name,
            e.first_name,
            e.sex,
            s.salary
        from
            employees e
            join salaries s on e.emp_no = s.emp_no
        order by
            e.emp_no asc
        LIMIT 10
        """

In [5]:
conn = engine.connect()
df = pd.read_sql(query, con = conn)
conn.close()

In [6]:
 df.head()

   emp_no last_name first_name sex  salary
0   10001   Facello     Georgi   M   60117
1   10002    Simmel    Bezalel   F   65828
2   10003   Bamford      Parto   M   40006
3   10004   Koblick  Chirstian   M   40054
4   10005  Maliniak    Kyoichi   M   78228